from termcolor import colored

#Proulogue
prologue = (colored("""
Ты просыпаешься в холодной, сырой камере, окружённый звуками капающей воды и шорохом невидимых существ. В голове ещё звучит эхо последнего воспоминания: ты был захвачен бандой разбойников, которые привели тебя сюда, чтобы оставить на произвол судьбы. Теперь ты один, без оружия и без надежды, но с горящей решимостью выбраться на свободу.

Свет пробивается сквозь трещины в потолке, создавая призрачные тени на стенах. Внезапно ты слышишь шёпот — это не просто игра воображения. Это голоса тех, кто когда-то также искал выход, но остался здесь навсегда. Они предупреждают о ловушках, чудовищах и древних заклинаниях, охраняющих тайны подземелья.

Теперь твое приключение начинается. Сможешь ли ты разгадать тайны подземелья и выбраться на свет? Время не ждет…
""", 'black'))

#Options
choise_2_option_1 = "1: Вы видите перед собой окно, оно заколочено железными листами"
choise_2_option_2 = "2: Вы видите перед собой дверь, кажется она из очень крепкого материала"
choise_2_option_3 = "3: Вы видите перед собой кровать, она даже чистая"

#Answers
choise_3_answer_1 = "Руками тут не справится, надо найти набор инструментов, либо можно накачать руки в местной качалке"
choise_3_answer_2 = "Дверь очень прочна, нужен динамит"
choise_3_answer_3 = "Посплю на дорожку, Zip Zip Zip, пока вы спали у вас был обыск, у соседа по камере нашли бутылку водки, пока его били вы взяли кусок разбитого стекла в качевстве оружия"
choise_4_answer_1 = "Ты отправился в качалку на пути ты встретил мощного зека, тебя избили"
choise_4_answer_2 = "Ты пока что не заслужил выходит из камеры никуда кроме качалки, тебя избили охранники"

#Pasta
wrongoption = "Такого варианта ответа, нет!"
bb = "До встречи воин!"
cs = "Продолжение следует"

#___________#___________#___________
'''person_1 = "Охраник пятерочки"
person_2 = "Мафия"
person_3_gg = "Инграм"
person_4 = "Алкаш"
person_5 = "Наркоман"
person_6 = "Нефор"

#Locate
locate_1 = "Пятерокча"
locate_2 = "КБ"
locate_3 = "Магнит"
locate_4 = "Лион"
locate_5 = "Шаурмечная"
locate_6 = "Магазин отца Инграма"

#choise_person_option = input("Выбери воина, кто будет спасать чекушку?: ")
#if choise_person_option == "Охраник пятерочки":
    #main_locate = locate_1
    #main_bad_person = person_6
    #print()
    #print("Ты выбрал", choise_person_option + " Ты находишься возле пятерочки")
#elif choise_person_option == "Мафия":
    #main_locate = locate_6
    #print()
    #print(main_locate)
'''
#___________#___________#___________